class Human:
    def __init__(self, age, name, sex):
        """
        Метод з ім`ям __init__ автоматично викликається, коли ми створюємо об'єкт.
        В даному методі створюють поля об'єкта і присовуюють їм значення.
        У кожному методі класу першим обов'язковим аргументом є self. self вказує на самого себе (тобто на об'єкт)
        Це потрібно для того, щоб ми могли маніпулювати даним об'єктом, що ми створюємо, всередині кожного метода
        """
        print(f"Start init new object with values: {age} {name} {sex}")
        self.age = age
        self.name = name
        self.sex = sex

me = Human(19, "Vlad", "M")