"""
Дано число, яке генерується рандомно. 
Написати програму, яка буде запитувати, 
яке ж це число до тих пір, доки користувач не відгадає. 
Якщо користувач вказав число більше, ніж згенероване, 
то виводити на екран “більше”, інакше - “менше”.
"""

import random

n = random.randint(0, 10)
while True:
    user_input = int(input("Введіть число: "))
    if user_input < n:
        print("Загадане число більше")
    elif user_input > n:
        print("Загадане число менше")
    else:
        break
print("Супер, ви вгадали, результат - ", user_input)